Configuration/Documents/ПредставлениеКНаграде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПредставлениеКНаграде</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительКадровогоПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательствующийНаОбщемСобрании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДолжностногоЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДолжности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтажРаботыВОтрасли</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПредставленияКНаградам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставитьКНаграде</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Enums/СтатусыПредставленияКНаградам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПредставленияКНаградам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаградаВручена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтудентРаботающийВСтудотряде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьНаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Documents/ПредставлениеКНаграде/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	ПроцессыНаграждения.СформироватьДвиженияДокументовНаграждения(Ссылка, Движения, ДанныеДляПроведения);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтейнерОшибок = Неопределено;

	ПретендентыКНаграждениюСвернуто = ПретендентыКНаграждению.Выгрузить();
	ПретендентыКНаграждениюСвернуто.Свернуть("Претендент,Награда");
	
	Если Не ПретендентыКНаграждению.Количество() = ПретендентыКНаграждениюСвернуто.Количество() Тогда
		
		Для Каждого УникальноеНаграждение Из ПретендентыКНаграждениюСвернуто Цикл
			
			НайденныеСтроки = ПретендентыКНаграждению.НайтиСтроки(Новый Структура("Претендент,Награда", УникальноеНаграждение.Претендент, УникальноеНаграждение.Награда));
			
			Если НайденныеСтроки.Количество() > 1 Тогда
				
				ТекстСообщения = НСтр("ru = 'Обнаружено дублирование строк по комбинации сотрудника / физического лица и награды'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПретендентыКНаграждению[%1].Претендент", ТекстСообщения, "",,, ПретендентыКНаграждению.Индекс(НайденныеСтроки[НайденныеСтроки.Количество()-1]));
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка.Номер, Истина, Истина));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредставлениеКНаграде.Организация КАК Организация,
	|	ПредставлениеКНаградеПретенденты.Награда КАК Награда,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПредставленияКНаградам.Рассматривается) КАК Статус,
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ) КАК Период,
	|	&НомерДокумента КАК НомерДокумента,
	|	ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредставлениеКНаградеПретенденты.ПредставитьКНаграде КАК ПредставленКНаграде,
	|	ПредставлениеКНаграде.ДатаВручения КАК ДатаВручения
	|ИЗ
	|	Документ.ПредставлениеКНаграде КАК ПредставлениеКНаграде
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ПретендентыКНаграждению КАК ПредставлениеКНаградеПретенденты
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеПретенденты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ФизическиеЛица КАК ПредставлениеКНаградеФизическиеЛица
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеФизическиеЛица.Ссылка
	|			И (ПредставлениеКНаградеПретенденты.Претендент = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо
	|				ИЛИ ВЫРАЗИТЬ(ПредставлениеКНаградеПретенденты.Претендент КАК Справочник.Сотрудники).ФизическоеЛицо = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо)
	|ГДЕ
	|	ПредставлениеКНаграде.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредставлениеКНаграде.Организация,
	|	ПредставлениеКНаградеПретенденты.Награда,
	|	ПредставлениеКНаградеПретенденты.Статус,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПредставлениеКНаградеПретенденты.ДатаУстановкиСтатуса, ДЕНЬ), СЕКУНДА, 1),
	|	&НомерДокумента,
	|	ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо,
	|	ПредставлениеКНаградеПретенденты.ПредставитьКНаграде,
	|	ПредставлениеКНаграде.ДатаВручения
	|ИЗ
	|	Документ.ПредставлениеКНаграде КАК ПредставлениеКНаграде
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ПретендентыКНаграждению КАК ПредставлениеКНаградеПретенденты
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеПретенденты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ФизическиеЛица КАК ПредставлениеКНаградеФизическиеЛица
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеФизическиеЛица.Ссылка
	|			И (ПредставлениеКНаградеПретенденты.Претендент = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо
	|				ИЛИ ВЫРАЗИТЬ(ПредставлениеКНаградеПретенденты.Претендент КАК Справочник.Сотрудники).ФизическоеЛицо = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо)
	|ГДЕ
	|	ПредставлениеКНаграде.Ссылка = &Ссылка
	|	И НЕ ПредставлениеКНаградеПретенденты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПредставленияКНаградам.ПустаяСсылка)";
	
	ДанныеДляПроведения = Новый Структура; 
	ДанныеДляПроведения.Вставить("СтатусыПредставленийКНаградам", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
